In [128]:
from sqlalchemy import create_engine, MetaData, Table, select, func
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Date
from sqlalchemy import ForeignKey
from datetime import datetime, timedelta
from sqlalchemy import Column, Integer, String, Float, ForeignKey, Sequence, CheckConstraint, UniqueConstraint
import pandas as pd
from sqlalchemy.orm import sessionmaker
from sqlalchemy import or_, and_
from sqlalchemy import distinct

In [129]:
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
engine = create_engine(db_string)
Base = declarative_base()

### Preparation of datasets

* Covid

In [130]:
data_covid = pd.read_excel('covid.xlsx')
new1 = data_covid[['Country', 'diabetes_prevalence', 'hospital_beds_per_thousand']]
new_enter = data_covid['stringency_index']
country_data = data_covid[['Country', 'Continent']]
del data_covid['diabetes_prevalence'], data_covid['hospital_beds_per_thousand'], data_covid['stringency_index'],data_covid['Continent']
data_covid = data_covid.rename(columns={'Country': "country", \
                                        'Date' : 'date'})
data_covid.head()

       country       date  totalCases  newCases  totalDeaths  newDeaths
0  Afghanistan 2020-01-01           0         0            0          0
1  Afghanistan 2020-01-02           0         0            0          0
2  Afghanistan 2020-01-03           0         0            0          0
3  Afghanistan 2020-01-04           0         0            0          0
4  Afghanistan 2020-01-05           0         0            0          0

* Education

In [131]:
data_edu = pd.read_excel('edukacja2.xlsx').drop_duplicates().dropna()
data_edu = data_edu.pivot(index='countryName', columns='Series Name', values='2016 [YR2016]')
data_edu = data_edu.rename(columns={'Children out of school (% of primary school age)': "childrenOutOfSchool", \
                            'Compulsory education, duration (years)' : 'compulsoryEducation',\
                            'Educational attainment, at least completed primary, population 25+ years, total (%) (cumulative)' : 'educationalAttainmentAtLeastPrimary',\
                            'Government expenditure on education, total (% of GDP)' : 'governmentExpenditureOnEducation'})
data_edu = data_edu.reset_index()
data_edu = data_edu.fillna(0)
data_edu.head()

Series Name,countryName,childrenOutOfSchool,compulsoryEducation,educationalAttainmentAtLeastPrimary,governmentExpenditureOnEducation
0,Afghanistan,0.00000,9.0,0.00000,4.22836
1,Albania,2.34458,9.0,0.00000,3.96209
2,Algeria,0.72481,10.0,0.00000,0.00000
3,Andorra,0.00000,10.0,96.51884,3.25670
4,Angola,0.00000,6.0,0.00000,0.00000

* Economy

In [132]:
data_economy = pd.read_excel('panstwa.xlsx')
country_data2 = data_economy[['Country Code', 'countryName']].drop_duplicates()
del data_economy['2017 [YR2017]'], data_economy['2018 [YR2018]']
data_economy = data_economy.pivot(index='countryName', columns='Series Name', values='2016 [YR2016]')
data_economy = data_economy.rename(columns={'GDP per capita (current US$)': "GDPPerCapita", \
                                            'Population ages 0-14 (% of total population)': 'populationAges_0_14',\
                                            'Population ages 15-64 (% of total population)': 'populationAges_15_64',\
                                            'Population ages 65 and above (% of total population)':'populationAges_65_above',\
                                            'Population density (people per sq. km of land area)' : 'populationDensity',\
                                            'Rural population (% of total population)': 'ruralPopulation',\
                                            'Urban population (% of total population)':'urbanPopulation'})
data_economy = data_economy.reset_index()
data_economy = data_economy.fillna(0)
data_economy.head()

Series Name,countryName,GDPPerCapita,populationAges_0_14,populationAges_15_64,populationAges_65_above,populationDensity,ruralPopulation,urbanPopulation
0,Afghanistan,547.228110,44.272113,53.207964,2.519923,54.197114,74.980,25.020
1,Albania,4124.108907,18.383696,68.660092,12.956211,104.967190,41.579,58.421
2,Algeria,3946.421445,29.134452,64.857566,6.007981,17.025957,28.541,71.459
3,Andorra,37224.108916,0.000000,0.000000,0.000000,164.461702,11.752,88.248
4,Angola,3506.072885,47.053352,50.685629,2.261018,23.135064,35.851,64.149

* Counties

In [133]:
country_data = country_data.drop_duplicates().dropna()
country_data = country_data.reset_index(drop=True)

country_data2 = country_data2.drop_duplicates().dropna()
country_data2 = country_data2.reset_index(drop=True)

country_data2['Continent'] = country_data['Continent']
country_data2 = country_data2.rename(columns={'Country Code': "countryCode", \
                                              'Country Name': 'countryName',\
                                              'Continent': 'continent'})
country_data2 = country_data2.fillna(0)
country_data2.head()

  countryCode  countryName continent
0         AFG  Afghanistan      Asia
1         ALB      Albania    Europe
2         DZA      Algeria    Africa
3         AND      Andorra    Europe
4         AGO       Angola    Africa

In [134]:
country_dict = pd.Series(country_data2['countryCode'].values, index=country_data2['countryName']).to_dict()

* Health

In [135]:
data_health = pd.read_excel('zdrowie.xlsx').drop_duplicates()
del data_health['2017 [YR2017]'], data_health['2018 [YR2018]']
data_health = data_health.pivot(index='countryName', columns='Series Name', values='2016 [YR2016]')
data_health = data_health.reset_index()
data_health = data_health.fillna(0)
data_health.head()

Series Name,countryName,causeOfDeathByCommunicableDiseases,healthExpenditure,lifeExpectancy,mortalityFemaleRate,mortalityInfantRate,mortalityMaleRate,mortalityRateDueToUnsafeWater,peopleWithBasicHandwashingFacilities
0,Afghanistan,36.4,10.961983,63.763,202.465,51.2,244.519,13.9,37.666535
1,Albania,2.9,0.000000,78.194,50.539,8.2,96.833,0.2,0.000000
2,Algeria,14.8,6.603844,76.298,83.113,21.0,105.595,1.9,83.652782
3,Andorra,0.0,10.324107,0.000,0.000,3.0,0.000,0.0,0.000000
4,Angola,63.4,2.713149,59.925,203.100,55.5,276.573,48.8,26.521273

### Creating connections between tables

* Covid_mapped

In [136]:
data_covid['country'] = data_covid['country'].map(country_dict)
data_covid = data_covid.rename(columns={'country': 'countryCode'})
data_covid.set_index('countryCode', inplace = True)
data_covid.head()

                  date  totalCases  newCases  totalDeaths  newDeaths
countryCode
AFG         2020-01-01           0         0            0          0
AFG         2020-01-02           0         0            0          0
AFG         2020-01-03           0         0            0          0
AFG         2020-01-04           0         0            0          0
AFG         2020-01-05           0         0            0          0

* Education_mapped

In [137]:
data_edu['countryName'] = data_edu['countryName'].map(country_dict)
data_edu = data_edu.rename(columns={'countryName': 'countryCode'})
data_edu.set_index('countryCode', inplace = True)
data_edu.head()

Series Name,childrenOutOfSchool,compulsoryEducation,educationalAttainmentAtLeastPrimary,governmentExpenditureOnEducation
countryCode,,,,
AFG,0.00000,9.0,0.00000,4.22836
ALB,2.34458,9.0,0.00000,3.96209
DZA,0.72481,10.0,0.00000,0.00000
AND,0.00000,10.0,96.51884,3.25670
AGO,0.00000,6.0,0.00000,0.00000

* Economy_mapped

In [138]:
data_economy['countryName'] = data_economy['countryName'].map(country_dict)
data_economy = data_economy.rename(columns={'countryName': 'countryCode'})
data_economy.set_index('countryCode', inplace = True)
data_economy.head()

Series Name,GDPPerCapita,populationAges_0_14,populationAges_15_64,populationAges_65_above,populationDensity,ruralPopulation,urbanPopulation
countryCode,,,,,,,
AFG,547.228110,44.272113,53.207964,2.519923,54.197114,74.980,25.020
ALB,4124.108907,18.383696,68.660092,12.956211,104.967190,41.579,58.421
DZA,3946.421445,29.134452,64.857566,6.007981,17.025957,28.541,71.459
AND,37224.108916,0.000000,0.000000,0.000000,164.461702,11.752,88.248
AGO,3506.072885,47.053352,50.685629,2.261018,23.135064,35.851,64.149

* Country_mapped

In [139]:
country_data2.set_index('countryCode', inplace = True)
country_data2.head()

             countryName continent
countryCode
AFG          Afghanistan      Asia
ALB              Albania    Europe
DZA              Algeria    Africa
AND              Andorra    Europe
AGO               Angola    Africa

* Health_mapped

In [140]:
data_health['countryName'] = data_health['countryName'].map(country_dict)
data_health = data_health.rename(columns={'countryName': 'countryCode'})
data_health.set_index('countryCode', inplace = True)
data_health.head()

Series Name,causeOfDeathByCommunicableDiseases,healthExpenditure,lifeExpectancy,mortalityFemaleRate,mortalityInfantRate,mortalityMaleRate,mortalityRateDueToUnsafeWater,peopleWithBasicHandwashingFacilities
countryCode,,,,,,,,
AFG,36.4,10.961983,63.763,202.465,51.2,244.519,13.9,37.666535
ALB,2.9,0.000000,78.194,50.539,8.2,96.833,0.2,0.000000
DZA,14.8,6.603844,76.298,83.113,21.0,105.595,1.9,83.652782
AND,0.0,10.324107,0.000,0.000,3.0,0.000,0.0,0.000000
AGO,63.4,2.713149,59.925,203.100,55.5,276.573,48.8,26.521273

### Creating databases

In [147]:
if engine.dialect.has_table(engine, "covid_ADB2020Table"):
    print("true")

In [148]:
class Covid_ADB2020BaseTable(Base):
    __tablename__ = 'covid_ADB2020Table'
    countryCode = Column(String(50), primary_key=True)
    date = Column(Date)
    totalCases = Column(Float, nullable = True)
    newCases = Column(Float, nullable = True)
    totalDeaths = Column(Float, nullable = True)
    newDeaths = Column(Float, nullable = True)

In [19]:
class Country_ADB2020(Base):
    __tablename__ = 'country_ADB2020'
    countryCode = Column(String(50), primary_key = True)
    countryName = Column(String(50), default = 'Unknown name')
    continent = Column(String(50), default = 'Unknown name')

In [20]:
class Edukacja_ADB2020(Base):
    __tablename__ = 'edukacja_ADB2020'
    countryCode = Column(String(50), primary_key = True)
    childrenOutOfSchool = Column(Float, nullable = False)
    compulsoryEducation = Column(Float, nullable = False)
    educationalAttainmentAtLeastPrimary = Column(Float, nullable = False)
    governmentExpenditureOnEducation = Column(Float, nullable = False)

In [21]:
class Economy_ADB2020(Base):
    __tablename__ = 'economy_ADB2020'
    countryCode = Column(String(50), primary_key=True)
    GDPPerCapita  = Column(Float, nullable = False)
    populationAges_0_14 = Column(Float, nullable = False)
    populationAges_15_64 = Column(Float, nullable = False)
    populationAges_65_above = Column(Float, nullable = False)
    populationDensity = Column(Float, nullable = False)
    ruralPopulation = Column(Float, nullable = False)
    urbanPopulation = Column(Float, nullable = False)

In [22]:
class Health_ADB2020(Base):
    __tablename__ = 'health_ADB2020'
    countryCode = Column(String(50), primary_key=True)
    causeOfDeathByCommunicableDiseases = Column(Float, nullable = False)
    healthExpenditure = Column(Float, nullable = False)
    lifeExpectancy = Column(Float, nullable = False)
    mortalityRateDueToUnsafeWater = Column(Float, nullable = False)
    mortalityFemaleRate = Column(Float, nullable = False)
    mortalityMaleRate = Column(Float, nullable = False)
    mortalityInfantRate = Column(Float, nullable = False)
    peopleWithBasicHandwashingFacilities = Column(Float, nullable = False)

In [120]:
Base.metadata.create_all(engine)

In [23]:
if engine.dialect.has_table(engine, "health_DBProject2020"):
    print("true")

true

### Inserting data into table

In [149]:
data_covid.to_sql('covid_ADB2020Table',engine, if_exists='append')

In [24]:
country_data2.to_sql("country_ADB2020",engine, if_exists='append')

In [110]:
data_edu.to_sql("edukacja_ADB2020",engine, if_exists='append')

In [26]:
data_economy.to_sql("economy_ADB2020",engine, if_exists='append')

In [109]:
data_health.to_sql("health_ADB2020",engine, if_exists='append')

### Chcecking correctness

In [151]:
from sqlalchemy.orm import sessionmaker

Session = sessionmaker(bind = engine)
session = Session()
stmt = "select count (*) from \"covid_ADB2020Table\""
print(session.execute(stmt).fetchall())

[(21244,)]

In [154]:
session_stmt1 = session.query(Economy_ADB2020.countryCode)
print(session_stmt1)
session_results1 = session_stmt1.all()
print(session_results1)

SELECT "economy_ADB2020"."countryCode" AS "economy_ADB2020_countryCode"
FROM "economy_ADB2020"
[('AFG',), ('ALB',), ('DZA',), ('AND',), ('AGO',), ('ATG',), ('ARG',), ('ARM',), ('ABW',), ('AUS',), ('AUT',), ('AZE',), ('BHS',), ('BHR',), ('BGD',), ('BRB',), ('BLR',), ('BEL',), ('BLZ',), ('BEN',), ('BMU',), ('BTN',), ('BOL',), ('BIH',), ('BWA',), ('BRA',), ('VGB',), ('BRN',), ('BGR',), ('BFA',), ('BDI',), ('KHM',), ('CMR',), ('CAN',), ('CYM',), ('CAF',), ('TCD',), ('CHL',), ('CHN',), ('COL',), ('COM',), ('CRI',), ('CIV',), ('HRV',), ('CUB',), ('CUW',), ('CYP',), ('CZE',), ('DNK',), ('DJI',), ('DMA',), ('DOM',), ('ECU',), ('EGY',), ('SLV',), ('GNQ',), ('EST',), ('ETH',), ('FRO',), ('FJI',), ('FIN',), ('FRA',), ('PYF',), ('GAB',), ('GMB',), ('GEO',), ('DEU',), ('GHA',), ('GIB',), ('GRC',), ('GRL',), ('GRD',), ('GUM',), ('GTM',), ('GIN',), ('GNB',), ('GUY',), ('HTI',), ('HND',), ('HKG',), ('HUN',), ('ISL',), ('IND',), ('IDN',), ('IRN',), ('IRQ',), ('IRL',), ('IMN',), ('ISR',), ('ITA',), ('JAM',), ('JPN',), ('JOR',), ('KAZ',), ('KEN',), ('XKX',), ('KWT',), ('KGZ',), ('LAO',), ('LVA',), ('LBN',), ('LSO',), ('LBR',), ('LBY',), ('LIE',), ('LTU',), ('LUX',), ('MDG',), ('MWI',), ('MYS',), ('MDV',), ('MLI',), ('MLT',), ('MRT',), ('MUS',), ('MEX',), ('MDA',), ('MCO',), ('MNG',), ('MNE',), ('MAR',), ('MOZ',), ('MMR',), ('NAM',), ('NPL',), ('NLD',), ('NCL',), ('NZL',), ('NIC',), ('NER',), ('NGA',), ('MNP',), ('NOR',), ('OMN',), ('PAK',), ('PAN',), ('PNG',), ('PRY',), ('PER',), ('PHL',), ('POL',), ('PRT',), ('PRI',), ('QAT',), ('ROU',), ('RUS',), ('RWA',), ('SMR',), ('STP',), ('SAU',), ('SEN',), ('SRB',), ('SYC',), ('SLE',), ('SGP',), ('SXM',), ('SVK',), ('SVN',), ('SOM',), ('ZAF',), ('SSD',), ('ESP',), ('LKA',), ('SDN',), ('SUR',), ('SWE',), ('CHE',), ('SYR',), ('TJK',), ('TZA',), ('THA',), ('TLS',), ('TGO',), ('TTO',), ('TUN',), ('TUR',), ('TCA',), ('UGA',), ('UKR',), ('ARE',), ('GBR',), ('USA',), ('URY',), ('UZB',), ('VEN',), ('VNM',), ('YEM',), ('ZMB',), ('ZWE',)]